<template>
  <div class="home">
    <table id="table" cellpadding="0" cellspacing="0" style="border-spacing:0px ">
      <tbody>
        <tr v-for="(trItem, index) in dataTable" :key="index">
          <td v-for="(tdItem, index) in trItem.td" :key="index">
            
            <table style="width: 100%; border-spacing: 0px" cellpadding="0" cellspacing="0">
              <tr v-for="(trChild, index) in tdItem" :key="index" border="0">
                <td style="border: 0px; transform: scale(1.3);" v-for="(tdChild, index) in trChild" :key="index">{{ tdChild }}</td>
              </tr>
            </table>
          </td>
        </tr>
      </tbody>
    </table>
  </div>
</template>

<script>

export default {
  name: 'Home',
  data() {
    return {
      dataTable: [
        {
          td: [
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            '',
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
          ],
        },
        {
          td: [
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            '',
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
          ],
        },
        {
          td: [
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
          ],
        },
        {
          td: [
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
          ],
        },
        {
          td: [
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
            [
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
              ['你', '好', '数', '据', '嗯', '结', '构'],
            ],
          ],
        },
      ],
    }
  }
}
</script>

<style>
#table {
  width: 100%;
  margin: 0px auto 0px;
  border-collapse: collapse;
  border: 1px solid #000000;
  height: 100vh;
}

#table td{
  border-collapse: collapse;
  border: 1px solid #000000;
  text-align: center;
}

/* 空白边框 */
#table > tbody > tr:nth-child(1)>td:nth-child(3){
  border-bottom: 1px solid transparent;
}

</style>